In [71]:
#Loading Data

%matplotlib inline
import numpy as np
import pandas as pd

df = pd.read_csv("data_assignment.csv")
df.head()

,Id,Title,Company,Date,Location,Area,Classification,SubClassification,Requirement,FullDescription,LowestSalary,HighestSalary,JobType
0,37404348,Casual Stock Replenisher,Aldi Stores,2018-10-07T00:00:00.000Z,Sydney,North West & Hills District,Retail & Consumer Products,Retail Assistants,Our Casual Stock Replenishers pride themselves...,NaN,0,30,NaN
1,37404337,Casual Stock Replenisher,Aldi Stores,2018-10-07T00:00:00.000Z,Richmond & Hawkesbury,NaN,Retail & Consumer Products,Retail Assistants,Our Casual Stock Replenishers pride themselves...,NaN,0,30,NaN
2,37404356,RETAIL SALES SUPERSTARS and STYLISTS Wanted - ...,LB Creative Pty Ltd,2018-10-07T00:00:00.000Z,Brisbane,CBD & Inner Suburbs,Retail & Consumer Products,Retail Assistants,BRAND NEW FLAGSHIP STORE OPENING - SUNSHINE PLAZA,NaN,0,30,NaN
3,37404330,Team member - Belrose,Anaconda Group Pty Ltd,2018-10-07T00:00:00.000Z,Gosford & Central Coast,NaN,Retail & Consumer Products,Retail Assistants,Bring it on - do you love the great outdoors a...,NaN,0,30,NaN
4,37404308,"Business Banking Contact Centre Specialist, Ni...",Commonwealth Bank - Business & Private Banking,2018-10-07T00:00:00.000Z,Sydney,Ryde & Macquarie Park,Call Centre & Customer Service,Sales - Inbound,"We are seeking highly articulate, enthusiastic...",NaN,0,30,NaN

In [72]:
#How many records are there in the dataset?
#Command returns the number of rows in the DataFrame

len(df)

149999

In [73]:
#Sorting values by date and showing the first 3 entries
df.sort_values(['Date']).head(3)

,Id,Title,Company,Date,Location,Area,Classification,SubClassification,Requirement,FullDescription,LowestSalary,HighestSalary,JobType
22645,37362027,Principal SharePoint Consultant,PBI Search,2018-10-01T00:00:00.000Z,Sydney,"CBD, Inner West & Eastern Suburbs",Information & Communication Technology,Consultants,"Work as Principal Consultant, leading and deli...",<div>This award-winning Consultancy and MS Gol...,150,200,Full Time
22746,37360134,Application Developer - IBM IIB,Compas Pty Ltd,2018-10-01T00:00:00.000Z,ACT,NaN,Information & Communication Technology,Developers/Programmers,Compas is seeking an experienced Application D...,Are you an <strong>Application Developer </str...,150,200,Contract/Temp
22747,37360123,Technical Consultant - Mainframe and ITSM,Sharp & Carter Digital and Technology,2018-10-01T00:00:00.000Z,Melbourne,NaN,Information & Communication Technology,Computer Operators,We are looking for several contractors for a 6...,<br>Technical Consultant &nbsp;- Mainframe &am...,150,200,Contract/Temp

In [74]:
#Sorting values by date and showing the last 3 entries
df.sort_values(['Date']).tail(3)

#First entry on 01/10/2018 and last on 13/11/2018

,Id,Title,Company,Date,Location,Area,Classification,SubClassification,Requirement,FullDescription,LowestSalary,HighestSalary,JobType
149348,37710158,Physiotherapist - Private Practice,Ivory Group,2018-11-13T00:00:00.000Z,Sydney,North West & Hills District,Healthcare & Medical,"Physiotherapy, OT & Rehabilitation",Join an established private practice in Sydney...,"<p style=""text-align:justify;""><strong>ABOUT T...",0,30,Full Time
149350,37710156,Big Data Analytics Engineer (Data Science Team),TRS - IT & Communications,2018-11-13T00:00:00.000Z,Sydney,"CBD, Inner West & Eastern Suburbs",Information & Communication Technology,Consultants,Huge Data Sets require a Data Scientist to per...,Our customer has access (hosts) some of the la...,0,30,Full Time
149998,37709311,Network Engineer,Robert Half Technology,2018-11-13T00:00:00.000Z,Perth,"CBD, Inner & Western Suburbs",Information & Communication Technology,Engineering - Network,Our client requires an experienced Network Eng...,<ul>\n <li><strong>Permanent Position...,0,30,Full Time

In [75]:
#Command returns the number of unique entries on the Date columns
df['Date'].nunique()

44

In [76]:
#Command returns the number of unique entries on the Location columns
df['Location'].nunique()

65

In [77]:
#Command returns the total rows for each column
df.count()

Id                   149999
Title                149999
Company              144237
Date                 149999
Location             149999
Area                  93496
Classification       149999
SubClassification    149999
Requirement          149999
FullDescription      146717
LowestSalary         149999
HighestSalary        149999
JobType              146766
dtype: int64

In [78]:
#Command returns the total rows for each Location in the dataset
df['Location'].value_counts()

Sydney                                  46357
Melbourne                               35315
Brisbane                                16538
Perth                                    9913
Adelaide                                 4998
                                        ...
Coober Pedy & Outback SA                   78
Tumut, Snowy & Monaro                      69
Somerset & Lockyer                         56
Fleurieu Peninsula & Kangaroo Island       53
Central & South East TAS                   36
Name: Location, Length: 65, dtype: int64

In [79]:
#Command returns the total rows for each sector in the dataset
df['Classification'].value_counts()

Information & Communication Technology    16661
Trades & Services                         14125
Healthcare & Medical                      12515
Hospitality & Tourism                     11818
Manufacturing, Transport & Logistics       9608
Administration & Office Support            7636
Accounting                                 7075
Education & Training                       7033
Retail & Consumer Products                 6496
Sales                                      6281
Construction                               6254
Government & Defence                       5926
Engineering                                4812
Mining, Resources & Energy                 4679
Community Services & Development           3528
Banking & Financial Services               3481
Human Resources & Recruitment              3233
Call Centre & Customer Service             3127
Legal                                      3071
Marketing & Communications                 3052
Real Estate & Property                     2729
Design & Architecture                      1379
Insurance & Superannuation                 1144
Consulting & Strategy                       905
Sport & Recreation                          750
Science & Technology                        696
Farming, Animals & Conservation             683
Advertising, Arts & Media                   644
CEO & General Management                    585
Self Employment                              73
Name: Classification, dtype: int64

In [80]:
#Command returns the total rows for each sub-sector inside the Science & Technology sector in the dataset
sciencedf = df[(df['Classification']=="Science & Technology")]
sciencedf['SubClassification'].value_counts()

Environmental, Earth & Geosciences                152
Laboratory & Technical Services                   128
Mathematics, Statistics & Information Sciences    102
Quality Assurance & Control                        67
Other                                              66
Biological & Biomedical Sciences                   65
Chemistry & Physics                                40
Food Technology & Safety                           32
Biotechnology & Genetics                           17
Materials Sciences                                 14
Modelling & Simulation                             13
Name: SubClassification, dtype: int64

In [81]:
#Checking the total sub-sectors inside the Science & Technology sector
sciencedf['SubClassification'].nunique()

11

In [82]:
#Listing the number of rows by LowestSalary and HighestSalary
salary_count = df.groupby(['LowestSalary','HighestSalary']).size()
print (salary_count)

LowestSalary  HighestSalary
0             30               27606
30            40               12441
40            50               17708
50            60               12559
60            70               14108
70            80               12932
80            100              12582
100           120              13062
120           150              10651
150           200              11738
200           250               4612
dtype: int64

In [83]:
#Seting up and cleaning a new DataFrame
df2 = pd.read_csv("data_assignment.csv")
del df2['Id']
del df2['Title']
del df2['Company']
del df2['Date']
del df2['Location']
del df2['Area']
del df2['SubClassification']
del df2['FullDescription']
del df2['Requirement']
del df2['JobType']

by_job = df2.groupby('Classification')

In [84]:
#Listing the lowest value for the LowestSalary and HighestSalary by sector
by_job.min()

                                        LowestSalary  HighestSalary
Classification
Accounting                                         0             30
Administration & Office Support                    0             30
Advertising, Arts & Media                          0             30
Banking & Financial Services                       0             30
CEO & General Management                           0             30
Call Centre & Customer Service                     0             30
Community Services & Development                   0             30
Construction                                       0             30
Consulting & Strategy                              0             30
Design & Architecture                              0             30
Education & Training                               0             30
Engineering                                        0             30
Farming, Animals & Conservation                    0             30
Government & Defence                               0             30
Healthcare & Medical                               0             30
Hospitality & Tourism                              0             30
Human Resources & Recruitment                      0             30
Information & Communication Technology             0             30
Insurance & Superannuation                         0             30
Legal                                              0             30
Manufacturing, Transport & Logistics               0             30
Marketing & Communications                         0             30
Mining, Resources & Energy                         0             30
Real Estate & Property                             0             30
Retail & Consumer Products                         0             30
Sales                                              0             30
Science & Technology                               0             30
Self Employment                                    0             30
Sport & Recreation                                 0             30
Trades & Services                                  0             30

In [85]:
#Listing the highest value for the LowestSalary and HighestSalary by sector
by_job.max()

                                        LowestSalary  HighestSalary
Classification
Accounting                                       200            250
Administration & Office Support                  200            250
Advertising, Arts & Media                        200            250
Banking & Financial Services                     200            250
CEO & General Management                         200            250
Call Centre & Customer Service                   200            250
Community Services & Development                 200            250
Construction                                     200            250
Consulting & Strategy                            200            250
Design & Architecture                            200            250
Education & Training                             200            250
Engineering                                      200            250
Farming, Animals & Conservation                  200            250
Government & Defence                             200            250
Healthcare & Medical                             200            250
Hospitality & Tourism                            200            250
Human Resources & Recruitment                    200            250
Information & Communication Technology           200            250
Insurance & Superannuation                       200            250
Legal                                            200            250
Manufacturing, Transport & Logistics             200            250
Marketing & Communications                       200            250
Mining, Resources & Energy                       200            250
Real Estate & Property                           200            250
Retail & Consumer Products                       200            250
Sales                                            200            250
Science & Technology                             200            250
Self Employment                                  200            250
Sport & Recreation                               200            250
Trades & Services                                200            250